#+Title: Exercise 4.38
**** fail case
#+BEGIN_SRC scheme :session 4-38 :exports both
  (ambeval-helper '(distinct? '(1 2 3 4 4)))
#+END_SRC

#+RESULTS:
: #f

**** Pass test case
#+BEGIN_SRC scheme :session 4-38 :exports both
  (ambeval-helper '(distinct? '(1 2 3 4 5)))
#+END_SRC

#+RESULTS:
: #t


** multiple-dwelling test
#+BEGIN_SRC scheme :session 4-38 :exports both
  (ambeval-helper '(multiple-dwelling))
#+END_SRC

#+RESULTS:
| baker    | 3 |
| cooper   | 2 |
| fletcher | 4 |
| miller   | 5 |
| smith    | 1 |


This is the same result as the book, validating the implementation for future use.

Even though the book says that it is very slow, it completed instantly on a 2017 12" MacBook base model.

Some thoughts on this:
I'm not sure when this was run, although it's known that amb was implemented by John McCarthy in the early days of Lisp, which leads me to believe that the version in the book could have been run in the 1980s, when the first version of the book was released. At that time, was it being run on the time sharing computers? Were computers back then really that slow?

** loop and find out the number of solutions

Compute the number of solutions
#+BEGIN_SRC scheme :session 4-38 :exports both
  (define solution-counter 0)

  (ambeval-helper '(multiple-dwelling))

  (set! solution-counter (+ 1 solution-counter))

  (define (try-again-loop)
    (try-again)
    (set! solution-counter (+ 1 solution-counter))
    (try-again-loop))

  (try-again-loop)

#+END_SRC

#+RESULTS:

Display the results
#+BEGIN_SRC scheme :session 4-38 :exports both
solution-counter
#+END_SRC

#+RESULTS:
: 5


